org/topics/golang.org
:PROPERTIES:
:ID:       b2831721-165d-4943-a41a-da770d96be41
:END:
#+title: Golang
* Resources
** Articles
 - 2022-08-17 ◦ [[https://www.reddit.com/r/golang/comments/wlw5bj/preferred_resource_for_advanced_go/][Preferred resource for 'advanced' Go? : golang]]
   - Some good recommendation for advanced Go learning resources
 - 2022-08-16 ◦ [[https://betterprogramming.pub/service-discovery-with-go-17b44011bcb2][Service Discovery with Go and mDNS]]
*** Botnets
- 2022-08-22 ◦ [[https://github.com/ThrillQuks/Pitraix][GitHub - ThrillQuks/Pitraix: Modern Self-Modifying Cross-Platform Peer-to-Peer Botnet over TOR]]
*** Microservices
- 2022-08-25 ◦ [[https://github.com/zeromicro/go-zero][go-zero]]

  A cloud-native Go [[id:adce7f16-ab79-4935-b73e-71f3740a071f][Microservices]] framework with cli tool for productivity.
