content/topics/golang.md
+++
title = "Golang"
draft = false
+++

## Resources {#resources}


### Articles {#articles}

-   2022-08-17 ◦ [Preferred resource for 'advanced' Go? : golang](https://www.reddit.com/r/golang/comments/wlw5bj/preferred_resource_for_advanced_go/)
    -   Some good recommendation for advanced Go learning resources
-   2022-08-16 ◦ [Service Discovery with Go and mDNS](https://betterprogramming.pub/service-discovery-with-go-17b44011bcb2)


#### Botnets {#botnets}

-   2022-08-22 ◦ [GitHub - ThrillQuks/Pitraix: Modern Self-Modifying Cross-Platform Peer-to-Peer Botnet over TOR](https://github.com/ThrillQuks/Pitraix)


#### Microservices {#microservices}

-   2022-08-25 ◦ [go-zero](https://github.com/zeromicro/go-zero)

    A cloud-native Go [Microservices]({{< relref "microservices.md" >}}) framework with cli tool for productivity.